In [97]:
# assignment
import numpy as np
import pandas as pd
# lets create the datafor retail domain with discount and other variable
data= {
    'product_id': np.random.randint(1000, 9999, 5000),
    'product_name': np.random.choice(['A', 'B', 'C', 'D', 'E'], 5000),
    'category': np.random.choice(['Electronics', 'Clothing', 'Groceries'], 5000),
    'brand': np.random.choice(['P', 'Q', 'R'], 5000),
    'price': np.random.uniform(10, 100, 5000),
    'quantity': np.random.randint(1, 20, 5000),
    'discount': np.random.uniform(0, 0.3, 5000)
}

df = pd.DataFrame(data)
df.head(10)

# Questions

# 1. What is the average price of products in each category?
# 2. Which brand has the highest average discount?
# 3. What is the total revenue generated from each product?
# 4. How many products are there in each category?
# 5. What is the most popular product (highest quantity sold)?

   product_id product_name     category brand      price  quantity  discount
0        6373            B    Groceries     R  80.432293        14  0.289924
1        4819            D    Groceries     R  57.401814        11  0.137177
2        3793            A     Clothing     Q  32.976432         8  0.106979
3        4529            E  Electronics     R  72.656923        13  0.297091
4        3227            A     Clothing     Q  77.090750         9  0.159693
5        9719            B    Groceries     R  94.889289        13  0.250273
6        2719            B     Clothing     R  12.058558        15  0.156364
7        5389            D     Clothing     Q  85.622782         4  0.009793
8        9841            B     Clothing     Q  89.917950         9  0.048437
9        1701            C    Groceries     Q  89.118756        12  0.210757

# 1.Average price of products in each category

In [98]:
avg_price_by_category = (df.groupby('category', as_index=False).agg(avg_price=('price', 'mean'))).sort_values(by='avg_price', ascending=False)

avg_price_by_category

      category  avg_price
2    Groceries  55.766221
1  Electronics  55.202880
0     Clothing  55.192364

#  2.Brand having highest average discount

In [99]:
avg_discount_by_brand = (df.groupby('brand', as_index=False).agg(avg_discount=('discount', 'mean')).sort_values(by='avg_discount', ascending=False))

avg_discount_by_brand

  brand  avg_discount
2     R      0.151468
0     P      0.150797
1     Q      0.149509

# 3.Total revenue generated from each product

In [100]:
df['revenue'] = df['price'] * df['quantity'] * (1 - df['discount'])

revenue_per_product = (df.groupby('product_id', as_index=False).agg(total_revenue=('revenue', 'sum')))

revenue_per_product.head()

   product_id  total_revenue
0        1001     128.973142
1        1005      10.856638
2        1006     208.813362
3        1008    1858.530954
4        1009     835.499695

# 4.Number of products in each category

In [101]:
No_products_per_category = (df.groupby('category', as_index=False).agg(product_count=('product_id', 'count')))

No_products_per_category

      category  product_count
0     Clothing           1674
1  Electronics           1619
2    Groceries           1707

# 5.Most popular product (highest quantity sold)

In [102]:
popular_product = (df.groupby('product_name', as_index=False).agg(total_quantity_sold=('quantity', 'sum')).sort_values(by='total_quantity_sold', ascending=False))

popular_product

  product_name  total_quantity_sold
4            E                10616
3            D                10072
2            C                10020
0            A                 9972
1            B                 9470

In [103]:
df.groupby('category',as_index=False).agg(High_price=('price','max'))

      category  High_price
0     Clothing   99.852948
1  Electronics   99.884425
2    Groceries   99.951972

In [104]:
df.groupby('category',as_index=False)

In [105]:
import numpy as np
sales_data = {
  'cust_id': np.random.randint(1000, 9999, 5000),
  'age': np.random.randint(18, 70, 5000),
  'gender': np.random.choice(['M', 'F'], 5000),
  'location': np.random.choice(['New York', 'Los Angeles', 'Chicago'], 5000),
  'product': np.random.choice(['Laptop', 'Smartphone', 'Tablet'], 5000),
  'quantity': np.random.randint(1, 3, 5000)
}
sales_df = pd.DataFrame(sales_data)

# price_data
price_data = {
  'product': np.random.choice(['Laptop', 'Smartphone', 'Tablet'], 5000),
  'price': np.random.uniform(100, 1500, 5000)
}
price_df = pd.DataFrame(price_data)

# Questions which need to solve?

# 1. What is the average price of products sold to different age groups?
# 2. How does the gender distribution look across different product categories?
# 3. What is the most popular product in each location?
# 4. Are there any correlations between age and the price of products purchased? # ignore for now - we will discuss in our maths
# 5. How does the sales distribution look across different locations?
# 6. What is the average quantity of products sold per transaction?
# 7. What is the total revenue generated from each product category?
# 8. What is the average price of products sold to different age groups?

In [106]:
sales_df.head(5)

   cust_id  age gender location product  quantity
0     6120   42      M  Chicago  Tablet         2
1     1876   46      F  Chicago  Tablet         1
2     7037   51      F  Chicago  Laptop         1
3     1456   43      M  Chicago  Laptop         1
4     2191   37      F  Chicago  Tablet         1

In [107]:
price_df.head(5)

  product       price
0  Tablet  994.850385
1  Laptop  852.032701
2  Laptop  727.521116
3  Tablet  137.776134
4  Laptop  761.727720

# Average price of products sold to different age groups

In [108]:
#merge tables 
final_table = sales_df.merge(price_df, on='product')

In [109]:
# Age Group function 
def age_group(x):
    if x < 25:
        return '18-24'
    elif 25 <= x < 35:
        return '25-34'
    elif 35 <= x < 45:
        return '35-44'
    elif 45 <= x < 55:
        return '45-54'
    else:
        return '55+'


final_table['age_group'] = final_table['age'].apply(age_group)

In [110]:
# Revenue (total price)
final_table['total_price'] = final_table['price'] * final_table['quantity']

final_table.head()

,cust_id,age,gender,location,product,quantity,price,age_group,total_price
0,6120,42,M,Chicago,Tablet,2,994.850385,35-44,1989.700770
1,6120,42,M,Chicago,Tablet,2,137.776134,35-44,275.552268
2,6120,42,M,Chicago,Tablet,2,1403.278996,35-44,2806.557991
3,6120,42,M,Chicago,Tablet,2,869.370512,35-44,1738.741024
4,6120,42,M,Chicago,Tablet,2,1139.450327,35-44,2278.900655

# Gender distribution across different categories

In [111]:
# 2. How does the gender distribution look across different product categories?
# lets do it from scratch
gender_distribution = final_table.groupby(['product', 'gender']).agg({'quantity': 'sum'})
# in terms of % age
def gender_percentage(x):
    return 100 * x / float(x.sum())

gender_distribution = gender_distribution.groupby(level=0).apply(gender_percentage)
gender_distribution

C:\Users\pslha\AppData\Local\Temp\ipykernel_11404\3126204426.py:6: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  return 100 * x / float(x.sum())

                               quantity
product    product    gender
Laptop     Laptop     F       50.040193
                      M       49.959807
Smartphone Smartphone F       51.293275
                      M       48.706725
Tablet     Tablet     F       48.514056
                      M       51.485944

In [112]:
# Step 1: aggregate quantity by product and gender
gender_distribution= (
    final_table
        .groupby(['product', 'gender']).agg({'quantity':'sum'})
)

# Step 2: calculate percentage within each product
gender_distribution['percentage'] = (
    gender_distribution
        .groupby('product')['quantity']
        .transform(lambda x: 100 * x / x.sum())
)

gender_distribution

                   quantity  percentage
product    gender
Laptop     F        2045535   50.040193
           M        2042249   49.959807
Smartphone F        2141029   51.293275
           M        2033064   48.706725
Tablet     F        2048768   48.514056
           M        2174272   51.485944

# Most popular product in each location

In [113]:
product_location_sales = (
    final_table
        .groupby(['location', 'product'],as_index=False)
        .agg(total_quantity=('quantity', 'sum'))
)

product_location_sales

      location     product  total_quantity
0      Chicago      Laptop         1319329
1      Chicago  Smartphone         1405206
2      Chicago      Tablet         1387328
3  Los Angeles      Laptop         1373548
4  Los Angeles  Smartphone         1375308
5  Los Angeles      Tablet         1422944
6     New York      Laptop         1394907
7     New York  Smartphone         1393579
8     New York      Tablet         1412768

In [114]:
most_popular_product = product_location_sales.loc[product_location_sales.groupby('location')['total_quantity'].idxmax()]
most_popular_product

      location     product  total_quantity
1      Chicago  Smartphone         1405206
5  Los Angeles      Tablet         1422944
8     New York      Tablet         1412768

# Sales distribution across different location

In [115]:
sales_distribution = (final_table.groupby('location', as_index=False).agg(total_sales=('quantity', 'sum')))

sales_distribution

      location  total_sales
0      Chicago      4111863
1  Los Angeles      4171800
2     New York      4201254

In [116]:
sales_distribution['sales_percentage']= 100 * sales_distribution['total_sales']/sales_distribution['total_sales'].sum()
sales_distribution

      location  total_sales  sales_percentage
0      Chicago      4111863         32.934644
1  Los Angeles      4171800         33.414720
2     New York      4201254         33.650636

# average quantity of products sold per transaction

In [117]:
avg_quantity_per_transaction = final_table.agg(avg_quantity_per_transaction=('quantity','mean'))

avg_quantity_per_transaction

                              quantity
avg_quantity_per_transaction   1.49811

In [118]:
# Revenue (total price)
final_table['total_price'] = final_table['price'] * final_table['quantity']

In [119]:
revenue_by_product = (
    final_table
        .groupby('product', as_index=False)
        .agg(total_revenue=('total_price', 'sum'))
)

revenue_by_product

      product  total_revenue
0      Laptop   3.262274e+09
1  Smartphone   3.319361e+09
2      Tablet   3.425754e+09

# Average price of products sold to different age groups

In [120]:
avg_price_by_age_group = (
    final_table
        .groupby('age_group', as_index=False)
        .agg(avg_price=('price', 'mean'))
)

avg_price_by_age_group

  age_group   avg_price
0     18-24  801.567002
1     25-34  801.803603
2     35-44  801.320271
3     45-54  801.715916
4       55+  801.582764